FunMod/DAB-500W-CCS/c2000.syscfg
epwm6.$name                                = "myEPWM5";
epwm6.$hardware                            = system.deviceData.board.components.PWM_LOC8;
epwm6.epwmTimebase_emulationMode           = "EPWM_EMULATION_FREE_RUN";
epwm6.epwmTimebase_hsClockDiv              = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_counterMode             = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmEventTrigger_enableInterrupt     = true;
epwm6.epwmEventTrigger_registerInterrupts  = true;
epwm6.epwmEventTrigger_interruptEventCount = "1";
epwm6.epwmTimebase_period                  = 1200;
epwm6.epwmCounterCompare_cmpA              = 600;
epwm6.epwmEventTrigger_interruptSource     = "EPWM_INT_TBCTR_U_CMPA";
epwm6.epwm.$assign                         = "EPWM8";
epwm6.epwmInt.enableInterrupt              = true;

epwm7.$name                                                    = "myEPWM6";
epwm7.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_period                                      = 3;
epwm7.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm7.$hardware                                                = system.deviceData.board.components.PWM_LOC6;
epwm7.epwmCounterCompare_cmpA                                  = 3;
epwm7.epwmCounterCompare_cmpB                                  = 3;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.epwmDeadband_enableRED                                   = true;
epwm7.epwmDeadband_enableFED                                   = true;
epwm7.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM5";
epwm7.epwmTimebase_phaseEnable                                 = true;
epwm7.epwmTimebase_phaseShift                                  = 1;

gpio1.$name             = "myGPIO0";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign   = "hsecDigital.82";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to CANA on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", gpio1, "gpioPin");

gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.controllerCore    = "GPIO_CORE_CPU1_CLA1";
gpio2.$name             = "TEST_IO";
gpio2.writeInitialValue = true;
gpio2.initialValue      = 1;
gpio2.gpioPin.$assign   = "hsecDigital.91";

gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.initialValue      = 1;
gpio3.$name             = "TEST_IO1";
gpio3.gpioPin.$assign   = "hsecDigital.93";

gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.$name             = "TEST_IO2";
gpio4.gpioPin.$assign   = "hsecDigital.95";

memcfg.config_MEMCFG_SECT_LS0        = "CLA_prog";
memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;
memcfg.config_MEMCFG_SECT_LS1        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS3        = "CLA_data";
memcfg.config_MEMCFG_SECT_LS2        = "CLA_prog";

sd1.Use_FilterChannel_1  = true;
sd1.Ch1_DataFilterEnable = true;
sd1.useCase              = "SINGLE CLOCK";
sd1.Ch1_SDFFIL           = "16";
sd1.SDFFINT              = ["FILTER1"];
sd1.Ch1_DOSR             = 64;
sd1.$name                = "DAB_IIN_SDFM";
sd1.sd.sd_c1Pin.$assign  = "hsecDigital.101";
sd1.sd.sd_d1Pin.$assign  = "hsecDigital.99";
sd1.sd.sd_d2Pin.$assign  = "hsecDigital.103";
sd1.sd.sd_d3Pin.$assign  = "hsecDigital.107";
sd1.sd.sd_d4Pin.$assign  = "hsecDigital.100";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sd1.sd, "sd_d4Pin");

sd2.useCase              = "CUSTOM";
sd2.useInterfacePins     = ["SD#_C1","SD#_D1"];
sd2.Ch1_DataFilterEnable = true;
sd2.Ch2_DataFilterEnable = true;
sd2.Ch2_DOSR             = 64;
sd2.Ch1_DOSR             = 64;
sd2.$name                = "DAB_IOUT_SDFM";
sd2.Use_FilterChannel_1  = true;
sd2.sd.sd_c1Pin.$assign  = "hsecDigital.106";
sd2.sd.sd_d1Pin.$assign  = "hsecDigital.104";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sd2.sd, "sd_c1Pin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EQEP2 on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sd2.sd, "sd_d1Pin");

sfo1.$name = "mySFO0";

controller1.$name            = "PI_CONTROLLER";
controller1.controllerChoice = "PI";
controller1.Umax             = "0.25f";
controller1.Umin             = "-0.25f";
controller1.Imax             = "0.25f";
controller1.Imin             = "-0.25f";
controller1.Kp               = "0.0001f";
controller1.Ki               = "0.6f";

refgen1.$name   = "myREFGEN0";
refgen1.ampl    = 10;
refgen1.offs    = 0;
refgen1.freq    = 1000;
refgen1.mode    = "STATIC";
refgen1.umax    = 120;
refgen1.sampPer = 0.00002;

CMD.activateCMD = true;
CMD.activeCMD   = "CMD_RAM";

CMD1.$name                             = "CMD_RAM";
CMD1.sectionMemory_ramfunc             = ["RAMM0"];
CMD1.sectionMemory_cinit               = ["RAMM0"];
CMD1.sectionMemory_switch              = ["RAMM0"];
CMD1.sectionMemory_stack               = ["RAMM1"];
CMD1.sectionMemory_init_array          = ["RAMM0"];
CMD1.sectionMemory_sysmem              = ["RAMGS2"];
CMD1.sectionMemory_data                = ["RAMGS0"];
CMD1.sectionMemory_cla1ToCpuMsgRAM     = ["CLATOCPU_MSGRAM"];
CMD1.sectionMemory_cpuToCla1MsgRAM     = ["CPUTOCLA_MSGRAM"];
CMD1.sectionMemory_const               = ["RAMGS2"];
CMD1.sectionMemory_bss                 = ["RAMLS7"];
CMD1.sectionMemory_cla1Prog            = ["RAMLS0","RAMLS1","RAMLS2"];
CMD1.sectionMemory_claConst            = ["RAMLS3"];
CMD1.sectionMemory_claScratchpad       = ["RAMLS3"];
CMD1.sectionMemory_bssCla              = ["RAMLS3"];
CMD1.sectionMemory_text                = ["RAMGS1","RAMGS3","RAMLS4","RAMLS5","RAMLS6","RAMLS7"];
CMD1.userSection.create(2);
CMD1.userSection[0].sectionName        = "dclfuncs";
CMD1.userSection[0].$name              = "dclfuncs_RAM";
CMD1.userSection[0].sectionAlignEnable = true;
CMD1.userSection[0].sectionAlign       = 2;
CMD1.userSection[0].sectionMemory      = ["RAMLS3"];
CMD1.userSection[1].$name              = "cla_shared";
CMD1.userSection[1].sectionName        = "cla_shared";
CMD1.userSection[1].sectionMemory      = ["RAMLS3"];

CMD2.$name                                      = "CMD_FLASH";
CMD2.sectionMemory_ramfunc                      = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_ramfunc                 = true;
CMD2.sectionRunFromDifferentAddr_ramfunc        = true;
CMD2.sectionMemory_text                         = ["FLASH_BANK0_SEC2","FLASH_BANK0_SEC3","FLASH_BANK0_SEC4"];
CMD2.sectionAlignEnable_text                    = true;
CMD2.sectionMemory_binit                        = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_binit                   = true;
CMD2.sectionMemory_cinit                        = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_cinit                   = true;
CMD2.sectionMemory_switch                       = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_switch                  = true;
CMD2.sectionMemory_stack                        = ["RAMM1"];
CMD2.sectionMemory_bss                          = ["RAMLS5"];
CMD2.sectionMemory_init_array                   = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_init_array              = true;
CMD2.sectionMemory_const                        = ["FLASH_BANK0_SEC4"];
CMD2.sectionAlignEnable_const                   = true;
CMD2.sectionMemory_data                         = ["RAMLS5"];
CMD2.sectionMemory_sysmem                       = ["RAMLS5"];
CMD2.sectionMemory_ovly                         = ["FLASH_BANK0_SEC1"];
CMD2.sectionAlignEnable_ovly                    = true;
CMD2.sectionMemory_codestart                    = "0x080000";
CMD2.sectionRun_ramfunc                         = ["RAMLS5"];
CMD2.userSection.create(1);
CMD2.userSection[0].sectionName                 = "dclfuncs";
CMD2.userSection[0].sectionRunFromDifferentAddr = true;
CMD2.userSection[0].sectionAlignEnable          = true;
CMD2.userSection[0].sectionRun                  = ["RAMLS7"];
CMD2.userSection[0].sectionMemory               = ["FLASH_BANK2_SEC10"];
CMD2.userSection[0].$name                       = "dclfuncs_FLASH";
CMD2.userSection[0].sectionBinit                = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                  = "ANALOG";
analog1.analog["a10/b1/c10Pin"].$suggestSolution = "hsecAnalog.25";
analog1.analog.a6Pin.$suggestSolution            = "hsecAnalog.23";
analog1.analog.b11Pin.$suggestSolution           = "hsecAnalog.24";
analog1.analog["b2/c6Pin"].$suggestSolution      = "hsecAnalog.14";
epwm1.epwm.$suggestSolution                      = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.49";
epwm1.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.51";
epwm2.epwm.$suggestSolution                      = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.53";
epwm2.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.55";
epwm3.epwm.$suggestSolution                      = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.50";
epwm3.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.52";
epwm4.epwm.$suggestSolution                      = "EPWM4";
epwm4.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.54";
epwm4.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.56";
epwm5.epwm.$suggestSolution                      = "EPWM5";
epwm5.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.57";
epwm5.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.59";
epwm6.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.62";
epwm6.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.64";
epwm7.epwm.$suggestSolution                      = "EPWM6";
epwm7.epwm.epwm_aPin.$suggestSolution            = "hsecDigital.61";
epwm7.epwm.epwm_bPin.$suggestSolution            = "hsecDigital.63";
sd1.sd.$suggestSolution                          = "SD1";
sd2.sd.$suggestSolution                          = "SD2";
